
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="territory.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    导语
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="territory.html">
            
                <a href="territory.html">
            
                    
                    一张领地地图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="lox.html">
            
                <a href="lox.html">
            
                    
                    lox 语言
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter1/">
            
                <a href="../chapter1/">
            
                    
                    Chapter1
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter1/section1.1.html">
            
                <a href="../chapter1/section1.1.html">
            
                    
                    Section1.1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter1/section1.2.html">
            
                <a href="../chapter1/section1.2.html">
            
                    
                    Section1.2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter2/">
            
                <a href="../chapter2/">
            
                    
                    Chapter2
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4ECB;&#x7ECD;">&#x4ECB;&#x7ECD;</h1>
<blockquote>
<p>&#x7AE5;&#x8BDD;&#x4E4B;&#x6240;&#x4EE5;&#x771F;&#x5B9E;&#xFF0C;&#x4E0D;&#x4EC5;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x8BA9;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x9F99;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x8FD8;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x9F99;&#x662F;&#x80FD;&#x88AB;&#x6218;&#x80DC;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x80FD;&#x4E00;&#x8D77;&#x5171;&#x8D74;&#x8FD9;&#x6BB5;&#x65C5;&#x7A0B;&#x662F;&#x4E00;&#x4EF6;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x4E8B;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x5B9E;&#x73B0;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x4E66;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E00;&#x672C;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x4E00;&#x95E8;&#x597D;&#x8BED;&#x8A00;&#x7684;&#x4E66;&#x3002;&#x5F53;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x6DF1;&#x5165;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5E0C;&#x671B;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4E66;&#xFF0C;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5FF5;&#x5934;&#x8426;&#x7ED5;&#x5728;&#x6211;&#x8111;&#x6D77;&#x5F88;&#x591A;&#x5E74;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x7BC7;&#x7AE0;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E00;&#x6B65;&#x6B65;&#x7684;&#x8D70;&#x8FC7;&#x4E24;&#x4E2A;&#x5B8C;&#x6574;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x5386;&#x7A0B;&#x3002;&#x6211;&#x5047;&#x5B9A;&#x8FD9;&#x662F;&#x4F60;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x6D89;&#x8DB3;&#x8BED;&#x8A00;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4F1A;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x5730;&#x8BB2;&#x89E3;&#x6BCF;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x548C;&#x6BCF;&#x4E00;&#x884C;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x671F;&#x4F60;&#x4EEC;&#x80FD;&#x591F;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#xFF0C;&#x53EF;&#x7528;&#x7684;&#xFF0C;&#x9AD8;&#x6548;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x628A;&#x4E24;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x653E;&#x8FDB;&#x8FD9;&#x672C;&#x4E66;&#x4E14;&#x8FD8;&#x907F;&#x514D;&#x7BC7;&#x5E45;&#x8FC7;&#x957F;&#xFF0C;&#x8BE5;&#x4E66;&#x7406;&#x8BBA;&#x5C42;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x4F1A;&#x76F8;&#x5BF9;&#x5C11;&#x70B9;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x6BCF;&#x4E00;&#x6A21;&#x5757;&#xFF0C;&#x6211;&#x4F1A;&#x4ECB;&#x7ECD;&#x5B83;&#x4EEC;&#x80CC;&#x540E;&#x7684;&#x5386;&#x53F2;&#x548C;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4E5F;&#x4F1A;&#x8BD5;&#x7740;&#x8BA9;&#x5927;&#x5BB6;&#x80FD;&#x591F;&#x719F;&#x6089;&#x8FD9;&#x4E9B;&#x884C;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x4EEC;&#x4EE5;&#x540E;&#x53C2;&#x52A0;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7814;&#x7A76;&#x7684;&#x9E21;&#x5C3E;&#x9152;&#x821E;&#x4F1A;&#x65F6;&#x5C31;&#x80FD;&#x6E38;&#x5203;&#x6709;&#x4F59;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x8FD8;&#x662F;&#x82B1;&#x5728;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x548C;&#x8FD0;&#x884C;&#x4E0A;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x8BF4;&#x7406;&#x8BBA;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x5728;&#x8BED;&#x8A00;&#x7814;&#x7A76;&#x4E0A;&#xFF0C;&#x51C6;&#x786E;&#x800C;&#x6709;&#x6761;&#x7406;&#x7684;&#x5206;&#x8FA8;&#x5404;&#x79CD;&#x8BED;&#x6CD5;&#x548C;&#x8BED;&#x4E49;&#x662F;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x7684;&#x6280;&#x80FD;&#x3002;&#x4F46;&#x4ECE;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x89D2;&#x5EA6;&#x4E0A;&#xFF0C;&#x6211;&#x8FB9;&#x505A;&#x8FB9;&#x5B66;&#x4F1A;&#x505A;&#x7684;&#x66F4;&#x597D;&#x4E9B;&#x3002;&#x6211;&#x5F88;&#x96BE;&#x8BFB;&#x5B8C;&#x5E76;&#x5438;&#x6536;&#x5145;&#x65A5;&#x7740;&#x5404;&#x79CD;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x7684;&#x6BB5;&#x843D;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x8BA9;&#x6211;&#x5199;&#x70B9;&#x4EE3;&#x7801;&#xFF0C;&#x8FD0;&#x884C;&#xFF0C;&#x8C03;&#x8BD5;&#xFF0C;&#x90A3;&#x6211;&#x5C31;&#x5B66;&#x4F1A;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x5BF9;&#x4F60;&#x4EEC;&#x7684;&#x671F;&#x5F85;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#x5BF9;&#x4E00;&#x95E8;&#x771F;&#x6B63;&#x7684;&#x8BED;&#x8A00;&#x5982;&#x4F55;&#x547C;&#x5438;&#x80FD;&#x6709;&#x5168;&#x9762;&#x7684;&#x89C2;&#x611F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x5728;&#x540E;&#x7EED;&#x518D;&#x8BFB;&#x5176;&#x4ED6;&#x7406;&#x8BBA;&#x4E66;&#x7C4D;&#x65F6;&#xFF0C;&#x90A3;&#x4E9B;&#x6982;&#x5FF5;&#x80FD;&#x7262;&#x7262;&#x7684;&#x5370;&#x5728;&#x4F60;&#x8111;&#x6D77;&#x4E2D;&#xFF0C;&#x4F9D;&#x9644;&#x5728;&#x8FD9;&#x4E9B;&#x672C;&#x4E66;&#x6240;&#x5B66;&#x7684;&#x57FA;&#x77F3;&#x4E4B;&#x4E0A;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x5B66;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;">&#x4E3A;&#x4EC0;&#x4E48;&#x5B66;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;</h2>
<p>&#x6BCF;&#x4E00;&#x672C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E66;&#x7C4D;&#x4F3C;&#x4E4E;&#x90FD;&#x4F1A;&#x6709;&#x8FD9;&#x4E00;&#x7BC7;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x4F1A;&#x5F15;&#x8D77;&#x5BF9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B58;&#x5728;&#x7684;&#x6000;&#x7591;&#x3002;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x4E00;&#x672C;&#x9E1F;&#x7C7B;&#x5B66;&#x7684;&#x4E66;&#x7C4D;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#x5B58;&#x5728;&#x7684;&#x5408;&#x7406;&#x6027;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x5047;&#x5B9A;&#x4E86;&#x9605;&#x8BFB;&#x8BE5;&#x4E66;&#x7684;&#x4EBA;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9E1F;&#x7C7B;&#x7231;&#x597D;&#x8005;&#x3002;</p>
<p>&#x4F46;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6709;&#x70B9;&#x7279;&#x6B8A;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x521B;&#x9020;&#x51FA;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x80FD;&#x591F;&#x8BBE;&#x8BA1;&#x51FA;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x4EBA;&#x5927;&#x6982;&#x80FD;&#x88C5;&#x8FDB;&#x4E00;&#x8F86;&#x901A;&#x7528;&#x6C7D;&#x8F66;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x7528;&#x628A;&#x9876;&#x68DA;&#x7684;&#x5E10;&#x7BF7;&#x6253;&#x5F00;&#x3002;&#x5982;&#x679C;&#x4F60;&#x628A;&#x52A0;&#x5165;&#x8FD9;&#x79CD;&#x7CBE;&#x82F1;&#x9635;&#x8425;&#x4F5C;&#x4E3A;&#x5B66;&#x4E60;&#x8BED;&#x8A00;&#x7684;&#x552F;&#x4E00;&#x76EE;&#x6807;&#xFF0C;&#x90A3;&#x8FD9;&#x4E66;&#x786E;&#x5B9E;&#x5F88;&#x96BE;&#x8BF4;&#x80FD;&#x52A9;&#x4F60;&#x8FBE;&#x6210;&#x76EE;&#x524D;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x8BED;&#x8A00;&#x6709;&#x5176;&#x4ED6;&#x76EE;&#x7684;&#x3002;</p>
<h3 id="&#x5FAE;&#x8BED;&#x8A00;&#x5230;&#x5904;&#x90FD;&#x662F;">&#x5FAE;&#x8BED;&#x8A00;&#x5230;&#x5904;&#x90FD;&#x662F;</h3>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x591A;&#x529F;&#x80FD;&#x8BED;&#x8A00;&#x90FD;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x5C0F;&#x7279;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4E3A;&#x201C;&#x5FAE;&#x8BED;&#x8A00;&#x201D;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x884C;&#x8BDD;&#x6548;&#x5E94;&#xFF0C;&#x4EBA;&#x4EEC;&#x6162;&#x6162;&#x5730;&#x79F0;&#x547C;&#x4ED6;&#x4EEC;&#x4E3A;&#x201C;&#x9886;&#x57DF;&#x4E13;&#x7528;&#x8BED;&#x8A00;&#x201D;&#x3002;&#x8FD9;&#x4E9B;&#x6DF7;&#x6742;&#x7684;&#x8BED;&#x8A00;&#x8BF8;&#x5982;&#xFF1A;&#x5E94;&#x7528;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3001;&#x6A21;&#x7248;&#x5F15;&#x64CE;&#x3001;&#x683C;&#x5F0F;&#x914D;&#x7F6E;&#x3001;&#x6587;&#x4EF6;&#x914D;&#x7F6E;&#x7B49;&#x7B49;&#x3002;</p>
<p><img src="http://craftinginterpreters.com/image/introduction/little-languages.png" alt="A random selection of little languages."></p>
<p>&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5927;&#x578B;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x5806;&#x8FD9;&#x4E9B;&#x5FAE;&#x8BED;&#x8A00;&#x3002;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x91CD;&#x7528;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x8BED;&#x8A00;&#x800C;&#x4E0D;&#x662F;&#x91CD;&#x590D;&#x53BB;&#x9020;&#x8F6E;&#x5B50;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x8003;&#x8651;&#x5230;&#x6587;&#x6863;&#x8BF4;&#x660E;&#xFF0C;&#x8C03;&#x8BD5;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x652F;&#x6301;&#xFF0C;&#x8BED;&#x6CD5;&#x9AD8;&#x4EAE;&#x548C;&#x5176;&#x4ED6;&#x53EF;&#x80FD;&#x7684;&#x5751;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x51FA;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x591A;&#x4E48;&#x8270;&#x96BE;&#x3002;</p>
<p>&#x4F46;&#x8FD8;&#x662F;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x67D0;&#x5929;&#x4F60;&#x7A81;&#x7136;&#x60F3;&#x7528;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x6216;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#x5374;&#x627E;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x80FD;&#x6EE1;&#x8DB3;&#x4F60;&#x8981;&#x6C42;&#x7684;&#x5E93;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x4E00;&#x4E2A;&#x80FD;&#x91CD;&#x7528;&#x7684;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x907F;&#x514D;&#x65E0;&#x6B62;&#x5883;&#x7684;&#x8C03;&#x8BD5;&#xFF0C;&#x7EF4;&#x62A4;&#x4EE5;&#x53CA;&#x9677;&#x5165;&#x5E93;&#x4EE3;&#x7801;&#x6EE1;&#x5C4F;&#x7684;&#x7EC6;&#x8282;&#x4E4B;&#x4E2D;&#x3002;</p>
<h3 id="&#x8BED;&#x8A00;&#x662F;&#x826F;&#x597D;&#x7684;&#x953B;&#x70BC;">&#x8BED;&#x8A00;&#x662F;&#x826F;&#x597D;&#x7684;&#x953B;&#x70BC;</h3>
<p>&#x957F;&#x8DD1;&#x8005;&#x6709;&#x65F6;&#x4F1A;&#x5728;&#x811A;&#x8E1D;&#x7ED1;&#x4E0A;&#x6C99;&#x888B;&#x6216;&#x8005;&#x5230;&#x7A7A;&#x6C14;&#x7A00;&#x8584;&#x7684;&#x9AD8;&#x6D77;&#x62D4;&#x5730;&#x533A;&#x8BAD;&#x7EC3;&#x3002;&#x5F53;&#x4ED6;&#x4EEC;&#x5378;&#x6389;&#x8D1F;&#x62C5;&#x65F6;&#xFF0C;&#x8F7B;&#x76C8;&#x7684;&#x811A;&#x6B65;&#x548C;&#x5145;&#x8DB3;&#x7684;&#x6C27;&#x6C14;&#x80FD;&#x8BA9;&#x4ED6;&#x4EEC;&#x8DD1;&#x7684;&#x66F4;&#x5FEB;&#x66F4;&#x8FDC;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x662F;&#x5BF9;&#x7F16;&#x7A0B;&#x6280;&#x80FD;&#x4E00;&#x6B21;&#x771F;&#x6B63;&#x7684;&#x6D4B;&#x9A8C;&#x3002;&#x4EE3;&#x7801;&#x5341;&#x5206;&#x590D;&#x6742;&#x540C;&#x65F6;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x4E5F;&#x5F88;&#x82DB;&#x523B;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x7BA1;&#x7406;&#x9012;&#x5F52;&#xFF0C;&#x52A8;&#x6001;&#x6570;&#x7EC4;&#xFF0C;&#x6811;&#xFF0C;&#x56FE;&#x5F62;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#x3002;&#x54C8;&#x5E0C;&#x8868;&#x4F60;&#x53EF;&#x80FD;&#x5929;&#x5929;&#x90FD;&#x5728;&#x7528;&#xFF0C;&#x4F46;&#x4F60;&#x662F;&#x5426;&#x771F;&#x6B63;&#x7684;&#x7406;&#x89E3;&#x5B83;&#x80CC;&#x540E;&#x7684;&#x539F;&#x7406;&#x5462;&#x3002;&#x522B;&#x62C5;&#x5FC3;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x82E6;&#x601D;&#x51A5;&#x60F3;&#x4E4B;&#x4E2D;&#x638C;&#x63E1;&#x8BED;&#x8A00;&#x8FD9;&#x95E8;&#x6280;&#x827A;&#x540E;&#xFF0C;&#x6211;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x8FD9;&#x4E00;&#x5207;&#x4F60;&#x90FD;&#x4F1A;&#x4E86;&#x7136;&#x4E8E;&#x5FC3;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x50CF;&#x4F60;&#x5C55;&#x793A;&#x4E86;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5E76;&#x6CA1;&#x6709;&#x4F60;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x53EF;&#x6015;&#xFF0C;&#x4F46;&#x5B83;&#x4ECD;&#x65E7;&#x662F;&#x4E00;&#x9879;&#x6311;&#x6218;&#x3002;&#x6B63;&#x9762;&#x9762;&#x5BF9;&#x5B83;&#xFF0C;&#x4F60;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x66F4;&#x4F18;&#x79C0;&#x7684;&#x7F16;&#x7A0B;&#x8005;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4F60;&#x7684;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x4F60;&#x4F1A;&#x66F4;&#x806A;&#x660E;&#x5408;&#x7406;&#x5730;&#x4F7F;&#x7528;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x3002;</p>
<h3 id="&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;">&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;</h3>
<p>&#x5BF9;&#x4E8E;&#x6211;&#x6765;&#x8BF4;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x96BE;&#x4EE5;&#x542F;&#x9F7F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x6211;&#x5185;&#x5FC3;&#x975E;&#x5E38;&#x9690;&#x79D8;&#x7684;&#x5730;&#x65B9;&#x3002;&#x66FE;&#x7ECF;&#x6211;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5B69;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x521D;&#x5B66;&#x7F16;&#x7A0B;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4F3C;&#x4E4E;&#x6709;&#x79CD;&#x9053;&#x4E0D;&#x6E05;&#x7684;&#x9B54;&#x529B;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x6253;&#x51FA;BASIC&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x6211;&#x60F3;&#x4E0D;&#x51FA;&#x6765;BASIC&#x662F;&#x600E;&#x4E48;&#x505A;&#x5230;&#x7684;&#x3002;</p>
<p>&#x540E;&#x6765;&#xFF0C;&#x6000;&#x7740;&#x5BF9;&#x6211;&#x5927;&#x5B66;&#x670B;&#x53CB;&#x7F16;&#x8BD1;&#x8BFE;&#x7A0B;&#x7684;&#x656C;&#x754F;&#x548C;&#x6050;&#x60E7;&#xFF0C;&#x6211;&#x9010;&#x6E10;&#x76F8;&#x4FE1;&#x90A3;&#x4E9B;&#x548C;&#x8BED;&#x8A00;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x79CD;&#x3002;&#x50CF;&#x662F;&#x67D0;&#x7C7B;&#x83B7;&#x53D6;&#x4E86;&#x7279;&#x6B8A;&#x4EE4;&#x724C;&#x7684;&#x7537;&#x5DEB;&#xFF0C;&#x4F18;&#x5148;&#x8FDB;&#x5165;&#x4E86;&#x8BED;&#x8A00;&#x8FD9;&#x4E2A;&#x795E;&#x79D8;&#x827A;&#x672F;&#x7684;&#x5927;&#x95E8;&#x3002;</p>
<p>&#x90A3;&#x662F;&#x4E00;&#x526F;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x613F;&#x666F;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x6709;&#x9ED1;&#x6697;&#x7684;&#x4E00;&#x9762;&#x3002;&#x6211;&#x4E0D;&#x89C9;&#x5F97;&#x6211;&#x50CF;&#x4E00;&#x4E2A;&#x7537;&#x5DEB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x7F3A;&#x5C11;&#x67D0;&#x79CD;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x7279;&#x8D28;&#x53BB;&#x52A0;&#x5165;&#x4ED6;&#x4EEC;&#x7684;&#x5C0F;&#x56E2;&#x4F53;&#x3002;&#x5373;&#x4F7F;&#x5982;&#x6B64;&#xFF0C;&#x5F53;&#x6211;&#x5728;&#x7B14;&#x8BB0;&#x672C;&#x4E0A;&#x968F;&#x610F;&#x7684;&#x753B;&#x51FA;&#x5173;&#x952E;&#x5B57;&#x65F6;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x88AB;&#x8BED;&#x8A00;&#x6DF1;&#x6DF1;&#x7684;&#x5438;&#x5F15;&#x4E86;&#x3002;&#x591A;&#x5E74;&#x4E4B;&#x540E;&#x6211;&#x624D;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x8BD5;&#x7740;&#x771F;&#x6B63;&#x7684;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x6700;&#x7EC8;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x7F1D;&#x8865;&#x6211;&#x7684;&#x5C0F;&#x5C0F;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x65F6;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x91CC;&#x9762;&#x4E00;&#x70B9;&#x9B54;&#x6CD5;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x53EA;&#x662F;&#x4EE3;&#x7801;&#x800C;&#x5DF2;&#xFF0C;&#x548C;&#x8BED;&#x8A00;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x4EBA;&#x4E5F;&#x53EA;&#x662F;&#x666E;&#x901A;&#x4EBA;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x6280;&#x672F;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x5B66;&#x4E60;&#x8BED;&#x8A00;&#x65F6;&#x4F1A;&#x9047;&#x5230;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x56F0;&#x96BE;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x4F1A;&#x6BD4;&#x4F60;&#x66FE;&#x7ECF;&#x514B;&#x670D;&#x7684;&#x969C;&#x788D;&#x96BE;&#x591A;&#x5C11;&#x3002;&#x6211;&#x7684;&#x5E0C;&#x671B;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x66FE;&#x7ECF;&#x5BF9;&#x8BED;&#x8A00;&#x611F;&#x5230;&#x6050;&#x60E7;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x672C;&#x4E66;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x6218;&#x80DC;&#x5B83;&#x4EEC;&#xFF0C;&#x8BA9;&#x4F60;&#x6BD4;&#x4EE5;&#x524D;&#x66F4;&#x52A0;&#x52C7;&#x6562;&#x4E9B;&#x3002;</p>
<p>&#x6216;&#x8005;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x80FD;&#x56E0;&#x6B64;&#x521B;&#x9020;&#x51FA;&#x4E0B;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x8C01;&#x77E5;&#x9053;&#x5462;&#x3002;&#x6709;&#x4EBA;&#x5C31;&#x8FD9;&#x4E48;&#x5E72;&#x8FC7;&#x3002;</p>
<h2 id="&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7ED3;&#x6784;">&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7ED3;&#x6784;</h2>
<p>&#x672C;&#x4E66;&#x5206;&#x4E3A;3&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5728;&#x770B;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x6709;&#x51E0;&#x4E2A;&#x7AE0;&#x8282;&#x4F1A;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x6559;&#x7ED9;&#x4F60;&#x4E00;&#x4E9B;hacker&#x4EEC;&#x5E38;&#x7528;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E0B;&#x6211;&#x4EEC;&#x540E;&#x9762;&#x8981;&#x5B9E;&#x73B0;&#x7684;Lox &#x8BED;&#x8A00;&#x3002;</p>
<p>&#x5269;&#x4E0B;&#x7684;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x5404;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;Lox &#x89E3;&#x91CA;&#x5668;&#x3002;&#x5728;&#x90A3;&#x4E24;&#x90E8;&#x5206;&#x91CC;&#xFF0C;&#x6BCF;&#x4E00;&#x7AE0;&#x8282;&#x7684;&#x7ED3;&#x6784;&#x90FD;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x7279;&#x6027;&#xFF0C;&#x4E86;&#x89E3;&#x80CC;&#x540E;&#x7684;&#x6982;&#x5FF5;&#x7136;&#x540E;&#x4EB2;&#x5386;&#x6574;&#x4E2A;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD9;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x8270;&#x96BE;&#x7684;&#x4E0D;&#x65AD;&#x8BD5;&#x9519;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x6211;&#x8FD8;&#x662F;&#x4F1A;&#x8BBE;&#x6CD5;&#x5C06;&#x4E24;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x5199;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x7BC7;&#x7AE0;&#x5927;&#x5C0F;&#xFF0C;&#x5C3D;&#x91CF;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x7BC7;&#x7AE0;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x5EFA;&#x7ACB;&#x5728;&#x4E0A;&#x4E00;&#x7BC7;&#x7AE0;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x8282;&#x91CC;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7A0B;&#x5E8F;&#x8BA9;&#x4F60;&#x8FD0;&#x884C;&#x3001;&#x778E;&#x9F13;&#x6363;&#xFF0C;&#x5F80;&#x540E;&#x7684;&#x7AE0;&#x8282;&#x91CC;&#xFF0C;&#x4F1A;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x7279;&#x6027;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x7F8E;&#x82F1;&#x6587;&#x77ED;&#x8BED;&#xFF0C;&#x6BCF;&#x4E00;&#x7AE0;&#x8282;&#x8FD8;&#x6709;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x4EAE;&#x70B9;&#xFF1A;</p>
<h3 id="&#x4EE3;&#x7801;">&#x4EE3;&#x7801;</h3>
<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x51C6;&#x5907;&#x5199;&#x89E3;&#x91CA;&#x5668;&#x4E86;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x4E66;&#x91CC;&#x4F1A;&#x5305;&#x542B;&#x771F;&#x6B63;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6BCF;&#x4E00;&#x884C;&#x89E3;&#x91CA;&#x5668;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x5305;&#x542B;&#x5728;&#x5185;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x5E94;&#x8BE5;&#x628A;&#x4EE3;&#x7801;&#x52A0;&#x8F7D;&#x4F60;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x8BED;&#x8A00;&#x4E66;&#x548C;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x90FD;&#x662F;&#x7528;&#x7C7B;&#x4F3C;Lex &#x548C;Yacc &#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x7C7B;&#x201C;&#x7F16;&#x8BD1;&#x7F16;&#x8BD1;&#x5668;&#x201D;&#x5DE5;&#x5177;&#x8D1F;&#x8D23;&#x628A;&#x66F4;&#x9AD8;&#x5C42;&#x7EA7;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x81EA;&#x52A8;&#x7FFB;&#x8BD1;&#x6210;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x5C42;&#x7EA7;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x90FD;&#x6709;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x5927;&#x5BB6;&#x5BF9;&#x8FD9;&#x4E9B;&#x4F18;&#x7F3A;&#x70B9;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8FD1;&#x4E4E;&#x5B97;&#x6559;&#x4FE1;&#x4EF0;&#x7684;&#x610F;&#x89C1;&#x3002;</p>
<blockquote>
<p>Yacc &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x8BED;&#x6CD5;&#x6587;&#x4EF6;&#x5E76;&#x751F;&#x6210;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x6709;&#x70B9;&#x50CF;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x624D;&#x4F1A;&#x53EB;&#x5B83;&#x201C;&#x7F16;&#x8BD1;&#x7F16;&#x8BD1;&#x5668;&#x201D;</p>
<p>Yacc&#x4E0D;&#x662F;&#x8FD9;&#x7C7B;&#x578B;&#x5DE5;&#x5177;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;Yacc&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#xFF08;Yet Another Compiler-Compiler &#x53E6;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x7F16;&#x8BD1;&#x5668;&#xFF09;&#x3002;&#x4E4B;&#x540E;&#x53C8;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x5DE5;&#x5177;&#x53EB;Bison&#xFF08;&#x91CE;&#x725B;&#xFF09;&#xFF0C;&#x540D;&#x5B57;&#x53D6;&#x81EA;Yacc&#x7684;&#x97F3;&#x4F3C;&#x540D;&#x8BCD;Yak&#xFF08;&#x8017;&#x725B;&#xFF09;&#x3002;</p>
<p><img src="http://craftinginterpreters.com/image/introduction/yak.png" alt="A yak."></p>
<p>&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x8FD9;&#x4E9B;&#x5F15;&#x7533;&#x77E5;&#x8BC6;&#x548C;&#x53CC;&#x5173;&#x8BED;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x90A3;&#x4F60;&#x5E94;&#x8BE5;&#x5F88;&#x5BB9;&#x6613;&#x9002;&#x5E94;&#x672C;&#x4E66;&#x540E;&#x7EED;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x90A3;&#x597D;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x5446;&#x5B50;&#x7684;&#x5E7D;&#x9ED8;&#x611F;&#x662F;&#x4E00;&#x79CD;&#x4E60;&#x5F97;&#x7684;&#x54C1;&#x5473;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4F1A;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x60F3;&#x786E;&#x4FDD;&#x90A3;&#x4E9B;&#x9B54;&#x6CD5;&#x548C;&#x56F0;&#x60D1;&#x65E0;&#x5904;&#x8EB2;&#x85CF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4F1A;&#x624B;&#x5199;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x53EF;&#x6015;&#xFF0C;&#x4F46;&#x5F88;&#x5FEB;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5C06;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x5E76;&#x719F;&#x77E5;&#x4E24;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x4E66;&#x672C;&#x7684;&#x9650;&#x5236;&#x548C;&#x771F;&#x5B9E;&#x60C5;&#x51B5;&#x603B;&#x662F;&#x4E0D;&#x5927;&#x76F8;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x4E66;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x7EF4;&#x62A4;&#x8F6F;&#x4EF6;&#x7684;&#x6700;&#x597D;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x6211;&#x6F0F;&#x4E86;&#x5199;private&#x5173;&#x952E;&#x5B57;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x60F3;&#x8BA9;&#x4F60;&#x4EEC;&#x770B;&#x4EE3;&#x7801;&#x66F4;&#x5BB9;&#x6613;&#x4E9B;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7BC7;&#x7AE0;&#x5E76;&#x4E0D;&#x50CF;&#x4F60;&#x7684;ide&#x90A3;&#x4E48;&#x806A;&#x660E;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x90FD;&#x65E0;&#x53EF;&#x6311;&#x5254;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x6CE8;&#x91CA;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x6BB5;&#x4EE3;&#x7801;&#x90FD;&#x4F1A;&#x6709;&#x597D;&#x51E0;&#x4E2A;&#x6BB5;&#x843D;&#x6765;&#x89E3;&#x91CA;&#x5B83;&#x3002;&#x5F53;&#x4F60;&#x81EA;&#x5DF1;&#x5199;&#x4E66;&#x65F6;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x5F88;&#x4E50;&#x610F;&#x5220;&#x6389;&#x9644;&#x5728;&#x4E66;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5199;&#x66F4;&#x591A;&#x7684; // &#x5728;&#x4E0A;&#x9762;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x6784;&#x4EF6;&#x3002;&#x6211;&#x5047;&#x8BBE;&#x4F60;&#x4EEC;&#x5DF2;&#x7ECF;&#x914D;&#x7F6E;&#x597D;&#x4E86;makefile &#x6216;&#x8005;ide&#x6765;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x3002;</p>
<h3 id="&#x4EE3;&#x7801;&#x7247;&#x6BB5;">&#x4EE3;&#x7801;&#x7247;&#x6BB5;</h3>
<p>&#x56E0;&#x4E3A;&#x8FD9;&#x672C;&#x4E66;&#x51E0;&#x4E4E;&#x5305;&#x542B;&#x4E86;&#x5B9E;&#x73B0;&#x6240;&#x9700;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x662F;&#x76F8;&#x5F53;&#x6E05;&#x6670;&#x7684;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x8FD8;&#x4F1A;&#x7ED9;&#x534A;&#x6210;&#x54C1;&#x7684;&#x7A0B;&#x5E8F;&#x52A0;&#x4E9B;&#x540E;&#x7EED;&#x4F1A;&#x66FF;&#x4EE3;&#x7684;&#x4E34;&#x65F6;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x9177;&#x70AB;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x5927;&#x6982;&#x957F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;</p>
<pre><code>default:
                                                       lox/Scanner.java
                                                       in scanToken()
                                                       replace 1 line
</code></pre><blockquote>
<p> if (isDigit(c)) {
&#x200B;          number();
&#x200B;        } else {
&#x200B;          Lox.error(line, &quot;Unexpected character.&quot;);
&#x200B;        }</p>
</blockquote>
<pre><code>    brek;
</code></pre><p>&#x4E2D;&#x95F4;&#x662F;&#x65B0;&#x52A0;&#x5165;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E0A;&#x4E0B;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x7528;&#x6765;&#x6807;&#x660E;&#x65B0;&#x4EE3;&#x7801;&#x52A0;&#x5165;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x65C1;&#x8FB9;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8BF4;&#x660E;&#x544A;&#x8BC9;&#x4F60;&#x64CD;&#x4F5C;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x201C;replace _ lines&#x201D;&#x5B57;&#x6BB5;&#xFF0C;&#x90A3;&#x5C31;&#x8BF4;&#x660E;&#x4F60;&#x9700;&#x8981;&#x62FF;&#x4E2D;&#x95F4;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x66FF;&#x6362;&#x6389;&#x539F;&#x6765;&#x7684;&#x5728;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E0A;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h3 id="&#x6CE8;&#x91CA;">&#x6CE8;&#x91CA;</h3>
<p>&#x6CE8;&#x91CA;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x4EBA;&#x7269;&#x7684;&#x6982;&#x8FF0;&#xFF0C;&#x5386;&#x53F2;&#x80CC;&#x666F;&#xFF0C;&#x76F8;&#x5173;&#x8BDD;&#x9898;&#x7684;&#x5F15;&#x7533;&#x8D44;&#x6599;&#x548C;&#x63A2;&#x7D22;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x3002;&#x5728;&#x540E;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8DF3;&#x8FC7;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#xFF0C;&#x4E0D;&#x4E86;&#x89E3;&#x6CE8;&#x91CA;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x6211;&#x4E0D;&#x4F1A;&#x8BC4;&#x5224;&#x4F60;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4F1A;&#x6709;&#x70B9;&#x4F24;&#x5FC3;&#x3002;</p>
<blockquote>
<p>&#x597D;&#x5427;&#xFF0C;&#x6709;&#x4E9B;&#x6CE8;&#x91CA;&#x786E;&#x5B9E;&#x633A;&#x91CD;&#x8981;&#x3002;&#x4F46;&#x5927;&#x90E8;&#x5206;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x8822;&#x840C;&#x7684;&#x7B11;&#x8BDD;&#x548C;&#x4E1A;&#x4F59;&#x7684;&#x80E1;&#x4E71;&#x6D82;&#x753B;&#x3002;</p>
</blockquote>
<h3 id="&#x6D4B;&#x9A8C;">&#x6D4B;&#x9A8C;</h3>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x7AE0;&#x8282;&#x7684;&#x540E;&#x9762;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x5C0F;&#x6D4B;&#x8BD5;&#x3002; &#x4E0D;&#x50CF;&#x6559;&#x79D1;&#x4E66;&#x90A3;&#x6837;&#x8003;&#x4F60;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6D4B;&#x9A8C;&#x662F;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x4F60;&#x5B66;&#x5230;&#x66F4;&#x591A;&#x7AE0;&#x8282;&#x4E4B;&#x5916;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x4E9B;&#x6D4B;&#x9A8C;&#x4F1A;&#x4F7F;&#x4F60;&#x8131;&#x79BB;&#x539F;&#x6709;&#x7684;&#x5F15;&#x5BFC;&#x8DEF;&#x7EBF;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x63A2;&#x7D22;&#x65B0;&#x7684;&#x9886;&#x57DF;&#x3002;&#x4F60;&#x4E5F;&#x4F1A;&#x7814;&#x7A76;&#x5176;&#x4ED6;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x627E;&#x51FA;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B;&#x7279;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x53EA;&#x80FD;&#x9760;&#x81EA;&#x5DF1;&#x82E6;&#x601D;&#x51A5;&#x60F3;&#x4E86;&#x3002;</p>
<p>&#x514B;&#x670D;&#x8FD9;&#x4E9B;&#x56F0;&#x96BE;&#x4F60;&#x4F1A;&#x5BF9;&#x8BED;&#x8A00;&#x6709;&#x66F4;&#x6DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6216;&#x8BB8;&#x8FD8;&#x80FD;&#x78B0;&#x649E;&#x51FA;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x706B;&#x82B1;&#x3002;&#x6216;&#x8005;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8DF3;&#x8FC7;&#xFF0C;&#x7EE7;&#x7EED;&#x5446;&#x5728;&#x8FD9;&#x8F86;&#x65C5;&#x884C;&#x5DF4;&#x58EB;&#x7684;&#x8212;&#x9002;&#x533A;&#x91CC;&#x3002;&#x4EFB;&#x541B;&#x9009;&#x62E9;&#x3002;</p>
<h3 id="&#x8BBE;&#x8BA1;&#x5C0F;&#x5EFA;&#x8BAE;">&#x8BBE;&#x8BA1;&#x5C0F;&#x5EFA;&#x8BAE;</h3>
<p>&#x5927;&#x90E8;&#x5206;&#x7684;&#x201C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x201D;&#x4E66;&#x7C4D;&#x5C31;&#x662F;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x4E66;&#x3002;&#x4ED6;&#x4EEC;&#x5F88;&#x5C11;&#x8BA8;&#x8BBA;&#x5BF9;&#x4E8E;&#x5B9E;&#x73B0;&#x7684;&#x8BED;&#x8A00;&#x8981;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x3002;&#x5B9E;&#x73B0;&#x786E;&#x5B9E;&#x662F;&#x4EF6;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#x4F46;&#x4ED6;&#x592A;&#x7CBE;&#x786E;&#x592A;&#x6B7B;&#x677F;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7F16;&#x7A0B;&#x8005;&#x4F3C;&#x4E4E;&#x5927;&#x90FD;&#x559C;&#x6B22;&#x975E;&#x9ED1;&#x5373;&#x767D;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x77E5;&#x9053;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x9ED1;&#x5BA2;&#x8D56;&#x4EE5;&#x4E3A;&#x751F;&#x3002;&#x4F60;&#x5728;&#x4ED6;&#x95E8;&#x53E3;&#x7559;&#x4E0B;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x7B49;&#x51E0;&#x4E2A;&#x6708;&#xFF0C;&#x4EE3;&#x7801;&#x548C;&#x6807;&#x51C6;&#x7ED3;&#x679C;&#x5C31;&#x4ECE;&#x4F1A;&#x95E8;&#x5185;&#x9001;&#x51FA;&#x6765;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x552F;&#x4E00;&#x9700;&#x8981;&#x7684;&#x5C31;&#x662F;&#x5404;&#x79CD;FORTRAN 77 &#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x8BBE;&#x8BA1;&#x4E00;&#x95E8;&#x5168;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x4F60;&#x5F00;&#x59CB;&#x8FD9;&#x79CD;&#x6E38;&#x620F;&#xFF0C;&#x5F88;&#x5FEB;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5929;&#x5E73;&#x7684;&#x53E6;&#x4E00;&#x9762;&#x8F6F;&#x6027;&#x7684;&#x4EBA;&#x6027;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x8BF8;&#x5982;&#x4EC0;&#x4E48;&#x7279;&#x6027;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#xFF0C;&#x5982;&#x4F55;&#x5E73;&#x8861;&#x521B;&#x65B0;&#x548C;&#x4E60;&#x60EF;&#xFF0C;&#x4EC0;&#x4E48;&#x7528;&#x7684;&#x8BED;&#x6CD5;&#x66F4;&#x53EF;&#x8BFB;&#x4EE5;&#x53CA;&#x5BF9;&#x8C01;&#x800C;&#x8A00;&#x53EF;&#x8BFB;&#x3002;</p>
<blockquote>
<p>&#x6240;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x4F1A;&#x628A;&#x5047;&#x5B9A;&#x7684;&#x5927;&#x5B54;&#x5361;&#x5C3A;&#x5BF8;&#x786C;&#x7F16;&#x7801;&#x8FDB;&#x5B83;&#x7684;&#x8BED;&#x8A00;&#x3002;</p>
</blockquote>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x6781;&#x5927;&#x5730;&#x5F71;&#x54CD;&#x8FD9;&#x4F60;&#x8FD9;&#x95E8;&#x65B0;&#x8BED;&#x8A00;&#x662F;&#x5426;&#x6210;&#x529F;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x7684;&#x8BED;&#x8A00;&#x80FD;&#x591F;&#x8131;&#x9896;&#x800C;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x67D0;&#x4E9B;&#x7AE0;&#x8282;&#x7684;&#x540E;&#x9762;&#x6211;&#x4F1A;&#x8D34;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x4EBA;&#x6027;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5C0F;&#x77ED;&#x6587;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x5BB6;&#xFF08;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x8C01;&#x624D;&#x662F;&#x4E13;&#x5BB6;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E0C;&#x671B;&#x4F60;&#x5BF9;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x592A;&#x8FC7;&#x8F83;&#x771F;&#x3002;&#x81F3;&#x5C11;&#x8FD9;&#x4F1A;&#x4F7F;&#x8FD9;&#x672C;&#x4E66;&#x8BFB;&#x8D77;&#x6765;&#x66F4;&#x6709;&#x5473;&#x9053;&#xFF0C;&#x6211;&#x7684;&#x76EE;&#x7684;&#x4E5F;&#x4EC5;&#x9650;&#x4E8E;&#x6B64;&#x3002;</p>
<h2 id="&#x7B2C;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;">&#x7B2C;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;</h2>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x7528;java&#x6765;&#x5199;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#xFF0C;jlox&#x3002;&#x8FD9;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x7528;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x5E72;&#x51C0;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x6B63;&#x786E;&#x5730;&#x5B9E;&#x73B0;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x4E49;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x719F;&#x77E5;&#x57FA;&#x672C;&#x7684;&#x6280;&#x672F;&#x4EE5;&#x53CA;&#x592F;&#x5B9E;&#x6211;&#x4EEC;&#x5BF9;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5982;&#x4F55;&#x8FD0;&#x4F5C;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>Java &#x5F88;&#x9002;&#x5408;&#x6765;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;Java&#x5C42;&#x7EA7;&#x8DB3;&#x591F;&#x9AD8;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x8BA9;&#x6211;&#x4EEC;&#x6DF9;&#x6CA1;&#x5728;&#x7E41;&#x7410;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x4E4B;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x4E0D;&#x4E22;&#x5931;&#x8BED;&#x8A00;&#x7684;&#x7B80;&#x7EC3;&#x3002;&#x4E0D;&#x50CF;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;Java&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5DEB;&#x5E08;&#x5E3D;&#x4E0B;&#x7684;&#x795E;&#x5947;&#x9B54;&#x6CD5;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;java&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x77E5;&#x9053;&#x4F60;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x9009;&#x62E9;java&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x79CD;&#x8303;&#x5F0F;&#x5728;&#x4E0A;&#x4E16;&#x7EAA;90&#x5E74;&#x4EE3;&#x6A2A;&#x626B;&#x7F16;&#x7A0B;&#x4E16;&#x754C;&#xFF0C;&#x5982;&#x4ECA;&#x5DF2;&#x4E3B;&#x5BFC;&#x7740;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7F16;&#x7A0B;&#x8005;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x3002;&#x4F60;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x4F7F;&#x7528;&#x7C7B;&#x548C;&#x65B9;&#x6CD5;&#x6765;&#x601D;&#x8003;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x4E66;&#x4E5F;&#x5C06;&#x4FDD;&#x6301;&#x8FD9;&#x4E00;&#x4E60;&#x60EF;&#xFF0C;&#x8BA9;&#x4F60;&#x7EE7;&#x7EED;&#x5446;&#x5728;&#x8212;&#x9002;&#x533A;&#x4E2D;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5B66;&#x9662;&#x8BED;&#x8A00;&#x6D3E;&#x7CFB;&#x6709;&#x65F6;&#x4F1A;&#x770B;&#x4E0D;&#x8D77;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x88AB;&#x5E7F;&#x6CDB;&#x8FD0;&#x7528;&#x5728;&#x8BED;&#x8A00;&#x5DE5;&#x4F5C;&#x4E2D;&#x5DF2;&#x662F;&#x4E0D;&#x4E89;&#x7684;&#x4E8B;&#x5B9E;&#x3002;GCC &#x548C; LLVM &#x7F16;&#x8BD1;&#x5668;&#x662F;&#x7528;C++&#x5199;&#x7684;&#xFF0C;&#x5927;&#x90E8;&#x5206;JavaScript&#x7684;&#x865A;&#x62DF;&#x673A;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x5DE5;&#x5177;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x662F;&#x7528;&#x8FD9;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x5199;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x7F16;&#x8BD1;&#x5668;&#x4ECE;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x5165;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x8F6C;&#x6362;&#x6210;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x540E;&#x8F93;&#x51FA;&#x5230;&#x53E6;&#x4E00;&#x6587;&#x4EF6;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x6765;&#x5B9E;&#x73B0;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x8981;&#x7F16;&#x8BD1;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x505A;&#x6CD5;&#x53EB;&#x505A;&#x81EA;&#x6211;&#x6258;&#x7BA1;&#xFF08;self-hosting&#xFF09;&#x3002;</p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x4F60;&#x505A;&#x4E0D;&#x5230;&#x81EA;&#x6211;&#x7F16;&#x8BD1;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x7528;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x6765;&#x7F16;&#x8BD1;&#x4F60;&#x5199;&#x7684;&#x8BED;&#x8A00;&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x62E5;&#x6709;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x7F16;&#x8BD1;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x539F;&#x5148;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x5199;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x9774;&#x5E26;&#x73B0;&#x8C61;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x62C9;&#x81EA;&#x5DF1;&#x7684;&#x9774;&#x5B50;&#x628A;&#x81EA;&#x5DF1;&#x63D0;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
</blockquote>
<p><img src="http://craftinginterpreters.com/image/introduction/bootstrap.png" alt="Fact: This is the primary mode of transportation of the American cowboy."></p>
<p>&#x56DE;&#x5230;&#x6B63;&#x9898;&#x3002;Java&#x5DF2;&#x7ECF;&#x5F88;&#x666E;&#x53CA;&#x4E86;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x592A;&#x591A;&#x94FA;&#x57AB;&#x77E5;&#x8BC6;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x672C;&#x4E66;&#x7684;&#x5B66;&#x4E60;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5BF9;Java&#x4E0D;&#x719F;&#x4E5F;&#x4E0D;&#x7528;&#x60CA;&#x614C;&#x3002;&#x6211;&#x4F1A;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;Java&#x7684;&#x6700;&#x5C0F;&#x5B50;&#x96C6;&#x6765;&#x5199;&#x89E3;&#x91CA;&#x5668;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x7528;&#x4E86;Java 7 &#x4E2D;&#x7684;&#x83F1;&#x5F62;&#x64CD;&#x4F5C;&#x7B26;&#x6765;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x6D01;&#x4E9B;&#xFF0C;&#x4F46;&#x8FD9;&#x5DF2;&#x7ECF;&#x662F;&#x76F8;&#x5BF9;&#x672C;&#x4E66;&#x800C;&#x8A00;&#x5341;&#x5206;&#x201C;&#x9AD8;&#x7EA7;&#x201D;&#x7684;&#x7279;&#x6027;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E86;&#x89E3;C++&#xFF0C;C#&#x4E4B;&#x7C7B;&#x7684;&#x5176;&#x4ED6;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x5F88;&#x5BB9;&#x6613;&#x8499;&#x6DF7;&#x8FC7;&#x53BB;&#x7684;&#x3002;</p>
<p>&#x5230;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7ED3;&#x675F;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x5F3A;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x5B9E;&#x73B0;&#xFF0C;&#x53EA;&#x662F;&#x6548;&#x7387;&#x53EF;&#x80FD;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x3002;&#x8FD9;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x8FD8;&#x4F9D;&#x8D56;java&#x865A;&#x62DF;&#x673A;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x60F3;&#x77E5;&#x9053;java&#x81EA;&#x5DF1;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x3002;</p>
<h2 id="&#x7B2C;&#x4E8C;&#x4E2A;&#x89E3;&#x91CA;&#x5668;">&#x7B2C;&#x4E8C;&#x4E2A;&#x89E3;&#x91CA;&#x5668;</h2>
<p>&#x4E0B;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x8FD9;&#x6B21;&#x7528;&#x7684;&#x662F;C&#x8BED;&#x8A00;&#x3002;C &#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x5F88;&#x597D;&#x7684;&#x7406;&#x89E3;&#x89E3;&#x91CA;&#x5668;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x5185;&#x5B58;&#x5B57;&#x8282;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#x548C;&#x4EE3;&#x7801;&#x4E0E;CPU&#x7684;&#x4EA4;&#x4E92;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;C&#x8BED;&#x8A00;&#x7684;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x6211;&#x80FD;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E00;&#x4E9B;C&#x7279;&#x522B;&#x64C5;&#x957F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x4E48;&#x8BED;&#x8A00;&#x975E;&#x5E38;&#x719F;&#x6089;&#x624D;&#x884C;&#x3002;&#x4F60;&#x4E0D;&#x9700;&#x8981;Dennis Ritchie&#x9644;&#x4F53;&#xFF0C;&#x4F46;&#x4F60;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x6307;&#x9488;&#x6240;&#x5413;&#x5012;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x597D;&#xFF0C;&#x9009;&#x672C;C&#x8BED;&#x8A00;&#x7684;&#x5165;&#x95E8;&#x4E66;&#x7C4D;&#x5E76;&#x4ED4;&#x7EC6;&#x5730;&#x6D88;&#x5316;&#x5B83;&#xFF0C;&#x7B49;&#x4F60;&#x505A;&#x5B8C;&#x8FD9;&#x4E9B;&#x518D;&#x56DE;&#x6765;&#x8FD9;&#x91CC;&#x3002;&#x6700;&#x4E3A;&#x56DE;&#x62A5;&#xFF0C;&#x4F60;&#x4ECE;&#x8FD9;&#x672C;&#x4E66;&#x8D70;&#x51FA;&#x6765;&#x540E;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x66F4;&#x4F18;&#x79C0;&#x7684;C&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x8FD9;&#x5BF9;&#x4F60;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x90FD;&#x662F;&#x7528;C&#x7684;&#xFF0C;Lua&#xFF0C;CPython&#xFF0C;Ruby&apos;s MRI &#x4E0D;&#x80DC;&#x679A;&#x4E3E;&#x3002;</p>
<p>&#x5728;C&#x89E3;&#x91CA;&#x5668;clox&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x96C6;&#x4E2D;&#x7CBE;&#x529B;&#x5B9E;&#x73B0;&#x6240;&#x6709;java&#x5E2E;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x4E86;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x81EA;&#x5DF1;&#x5199;&#x52A8;&#x6001;&#x6570;&#x7EC4;&#x548C;&#x54C8;&#x5E0C;&#x8868;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x89C4;&#x5B9A;&#x5BF9;&#x8C61;&#x5728;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6765;&#x56DE;&#x6536;&#x5B83;&#x4EEC;&#x3002;</p>
<blockquote>
<p>clox&#xFF0C;&#x6211;&#x53D1;&#x97F3;&#x6709;&#x70B9;&#x50CF;&#x201C;sea-locks&#x201D;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x201C;clocks&#x201D; &#x751A;&#x81F3; &#x201C;clochs&#x201D;&#x3002;&#x540E;&#x8005;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x5E0C;&#x814A;&#x8BED;&#xFF0C;&#x968F;&#x4F60;&#x5F00;&#x5FC3;&#x600E;&#x4E48;&#x53EB;&#x90FD;&#x884C;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x7684;Java&#x7248;&#x672C;&#x7684;&#x5B9E;&#x73B0;&#x4E13;&#x6CE8;&#x4E8E;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6C42;&#x66F4;&#x9AD8;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;&#x6211;&#x4EEC;&#x7684;C&#x89E3;&#x91CA;&#x5668;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x628A;&#x4EE3;&#x7801;&#x7FFB;&#x8BD1;&#x6210;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x9AD8;&#x6548;&#x5B57;&#x8282;&#x7801;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5B9E;&#x73B0;Lua&#xFF0C;Python&#xFF0C;Ruby&#xFF0C;PHP&#xFF0C;&#x7B49;&#x5176;&#x4ED6;&#x6210;&#x529F;&#x8BED;&#x8A00;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<blockquote>
<p>&#x4F60;&#x89C9;&#x5F97;&#x8FD9;&#x672C;&#x4E66;&#x53EA;&#x662F;&#x8BB2;&#x89E3;&#x91CA;&#x5668;&#x5417;&#xFF1F;&#x4E0D;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x4E00;&#x672C;&#x6709;&#x5173;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4E66;&#x7C4D;&#x3002;&#x52A0;&#x91CF;&#x4E0D;&#x52A0;&#x4EF7;&#xFF01;&#x563B;&#x563B;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x7740;&#x624B;&#x6D4B;&#x8BD5;&#x548C;&#x4F18;&#x5316;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#xFF0C;&#x7CBE;&#x786E;&#xFF0C;&#x9AD8;&#x6548;&#x7684;lox&#x8BED;&#x8A00;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x8DB3;&#x591F;&#x548C;&#x5176;&#x4ED6;&#x4F18;&#x79C0;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x6BD4;&#x80A9;&#x3002;&#x8FD9;&#x4E5F;&#x4E0D;&#x6789;&#x8D39;&#x6B64;&#x4E66;&#x548C;&#x51E0;&#x5343;&#x884C;&#x4EE3;&#x7801;&#x3002;</p>
<h3 id="&#x6D4B;&#x9A8C;&#xFF1A;">&#x6D4B;&#x9A8C;&#xFF1A;</h3>
<ol>
<li>&#x62FC;&#x63A5;&#x8FD9;&#x4E2A;&#x7F16;&#x5199;&#x548C;&#x53D1;&#x884C;&#x6B64;&#x4E66;&#x7684;&#x5C0F;&#x7CFB;&#x7EDF;&#x6211;&#x81F3;&#x5C11;&#x7528;&#x4E86;&#x516D;&#x79CD;&#x9886;&#x57DF;&#x4E13;&#x7528;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x7528;Java&#x5199;&#x4E00;&#x4E2A;&#x201C;Hello&#xFF0C;world&#x201D; &#x7A0B;&#x5E8F;&#xFF0C;&#x968F;&#x4FBF;&#x4EC0;&#x4E48;makefiles&#x548C;IDE&#x5DE5;&#x5177;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x719F;&#x6089;&#x5B83;&#xFF0C;&#x7528;&#x5355;&#x6B65;&#x8C03;&#x8BD5;&#x77E5;&#x9053;&#x7A0B;&#x5E8F;&#x6210;&#x529F;&#x8DD1;&#x8D77;&#x6765;&#x3002;</li>
<li>&#x540C;&#x6837;&#x4E5F;&#x7528;C&#x5199;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x7EC3;&#x4E60;&#x4E0B;&#x6307;&#x9488;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5806;&#x5185;&#x5B58;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x53CC;&#x5411;&#x94FE;&#x8868;&#x3002;&#x5B9E;&#x73B0;&#x589E;&#x5220;&#x6539;&#x67E5;&#x65B9;&#x6CD5;&#x5E76;&#x6D4B;&#x8BD5;&#x5B83;&#x4EEC;&#x3002;</li>
</ol>
<h3 id="&#x8BBE;&#x8BA1;&#x5EFA;&#x8BAE;&#xFF1A;&#x5982;&#x4F55;&#x53D6;&#x4E2A;&#x597D;&#x540D;&#x5B57;">&#x8BBE;&#x8BA1;&#x5EFA;&#x8BAE;&#xFF1A;&#x5982;&#x4F55;&#x53D6;&#x4E2A;&#x597D;&#x540D;&#x5B57;</h3>
<p>&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x6700;&#x5927;&#x7684;&#x6311;&#x6218;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x600E;&#x4E48;&#x7ED9;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x8BED;&#x8A00;&#x53D6;&#x4E00;&#x4E2A;&#x597D;&#x540D;&#x5B57;&#x3002;&#x6211;&#x5199;&#x4E86;&#x597D;&#x51E0;&#x9875;&#x7EB8;&#x7684;&#x540D;&#x5B57;&#x624D;&#x627E;&#x5230;&#x51D1;&#x5408;&#x80FD;&#x7528;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x6253;&#x7B97;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#x662F;&#xFF0C;&#x4F60;&#x5728;&#x7B2C;&#x4E00;&#x5929;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x53D6;&#x540D;&#x662F;&#x591A;&#x4E48;&#x96BE;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x540D;&#x5B57;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ol>
<li><strong>&#x6CA1;&#x6709;&#x88AB;&#x5360;&#x7528;&#x3002;</strong> &#x5982;&#x679C;&#x4F60;&#x5360;&#x7528;&#x4E86;&#x67D0;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x90A3;&#x4F1A;&#x9677;&#x5165;&#x5404;&#x79CD;&#x9EBB;&#x70E6;&#x4E4B;&#x4E2D;&#xFF0C;&#x6CD5;&#x5F8B;&#x7684;&#x793E;&#x4F1A;&#x7684;&#x7B49;&#x7B49;&#x3002;</li>
<li><strong>&#x5BB9;&#x6613;&#x53D1;&#x97F3;</strong>&#x3002;&#x5982;&#x679C;&#x4E8B;&#x60C5;&#x53D1;&#x5C55;&#x987A;&#x5229;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x5927;&#x5E2E;&#x4EBA;&#x8BF4;&#x4F60;&#x7684;&#x8BED;&#x8A00;&#x5199;&#x4F60;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x8FC7;&#x591A;&#x7684;&#x97F3;&#x8282;&#x6216;&#x8005;&#x592A;&#x591A;&#x7684;&#x5B57;&#x6BCD;&#x4F1A;&#x6C38;&#x65E0;&#x6B62;&#x5883;&#x7684;&#x56F0;&#x6270;&#x7740;&#x4EBA;&#x4EEC;&#x3002;</li>
<li><strong>&#x8BA9;&#x4EBA;&#x5F88;&#x6E05;&#x6670;&#x5730;&#x641C;&#x7D22;&#x5230;</strong>&#x3002;&#x4EBA;&#x4EEC;&#x4F1A;&#x53BB;google &#x4F60;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x5BFB;&#x627E;&#x76F8;&#x5E94;&#x5730;&#x6587;&#x6863;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5E94;&#x8BE5;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x5C11;&#x89C1;&#x7684;&#x5355;&#x8BCD;&#x8BA9;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x91CC;&#x5927;&#x90FD;&#x662F;&#x5173;&#x4E8E;&#x4F60;&#x7684;&#x8BED;&#x8A00;&#x7684;&#x3002;&#x5C3D;&#x7BA1;&#x73B0;&#x5728;&#x5927;&#x90E8;&#x5206;&#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5DF2;&#x7ECF;&#x5341;&#x5206;&#x667A;&#x80FD;&#x4E86;&#x3002;&#x6BD5;&#x7ADF;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x201C;for&#x201D;&#x7684;&#x8BED;&#x8A00;&#x4E0D;&#x4F1A;&#x7ED9;&#x4EBA;&#x4EEC;&#x4EFB;&#x4F55;&#x5E2E;&#x52A9;&#x3002;</li>
<li><strong>&#x786E;&#x4FDD;&#x5728;&#x4F17;&#x591A;&#x6587;&#x5316;&#x4E2D;&#x6CA1;&#x6709;&#x6D88;&#x6781;&#x7684;&#x610F;&#x4E49;</strong>&#x3002;&#x8FD9;&#x5F88;&#x96BE;&#x4FDD;&#x8BC1;&#xFF0C;&#x4F46;&#x662F;&#x662F;&#x503C;&#x5F97;&#x8003;&#x8651;&#x7684;&#x4E8B;&#x60C5;&#x3002;Nimrod &#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x628A;&#x540D;&#x5B57;&#x6539;&#x6210;&#x4E86;&#x201C;Nim&#x201D;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x592A;&#x591A;&#x4EBA;&#x53EA;&#x8BB0;&#x7684;&#x5154;&#x516B;&#x54E5;&#x91CC;&#x628A;&#x201C;Nimrod&#x201D;&#x4F5C;&#x4E3A;&#x7F9E;&#x8FB1;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#x3002;</li>
</ol>
<p>&#x5982;&#x679C;&#x4F60;&#x6F5C;&#x5728;&#x7684;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0A;&#x6B8B;&#x9177;&#x8003;&#x9A8C;&#xFF0C;&#x7559;&#x7740;&#x5B83;&#x3002;&#x4E0D;&#x8981;&#x82B1;&#x592A;&#x591A;&#x7CBE;&#x529B;&#x5728;&#x8BD5;&#x56FE;&#x627E;&#x4E00;&#x4E2A;&#x7B26;&#x5408;&#x4F60;&#x8BED;&#x8A00;&#x6240;&#x6709;&#x7279;&#x6027;&#x7684;&#x540D;&#x8BCD;&#x3002;&#x5982;&#x679C;&#x4E00;&#x95E8;&#x4E16;&#x754C;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x6559;&#x7ED9;&#x6211;&#x4EEC;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x662F;&#x540D;&#x5B57;&#x5E76;&#x4E0D;&#x662F;&#x591A;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F60;&#x9700;&#x8981;&#x7684;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x72EC;&#x7ACB;&#x65E0;&#x4E8C;&#x7684;&#x8C61;&#x5F81;&#x800C;&#x5DF2;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 导语">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="territory.html" class="navigation navigation-next " aria-label="Next page: 一张领地地图">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"介绍","level":"1.2.1","depth":2,"next":{"title":"一张领地地图","level":"1.2.2","depth":2,"path":"welcome/territory.md","ref":"welcome/territory.md","articles":[]},"previous":{"title":"导语","level":"1.2","depth":1,"path":"welcome/README.md","ref":"welcome/README.md","articles":[{"title":"介绍","level":"1.2.1","depth":2,"path":"welcome/introduction.md","ref":"welcome/introduction.md","articles":[]},{"title":"一张领地地图","level":"1.2.2","depth":2,"path":"welcome/territory.md","ref":"welcome/territory.md","articles":[]},{"title":"lox 语言","level":"1.2.3","depth":2,"path":"welcome/lox.md","ref":"welcome/lox.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"welcome/introduction.md","mtime":"2018-08-06T02:55:58.725Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-10T09:45:11.296Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

